---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteShopDrawingsWarn
source: html/493a1502-5d33-39d4-a59a-d7774a4d17de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteShopDrawingsWarn Property

The assembly instance has associated views and cannot be merged with assembly type '%1!s!'. Delete the views to continue.\n\nViews:%2!s!

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteShopDrawingsWarn { get; }
```